src/integ-test/bdd-test/resources/xml/paGetPayment_5transfer_full.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paGetPaymentRes>
            <outcome>$outcome</outcome>
            <data>
                <creditorReferenceId>$creditorReferenceId</creditorReferenceId>
                <paymentAmount>$paymentAmount</paymentAmount>
                <dueDate>$dueDate</dueDate>
                <!--Optional:-->
				<retentionDate>2021-12-31T12:12:12</retentionDate>
				<!--Optional:-->
				<lastPayment>1</lastPayment>
				<description>$description</description>
				<!--Optional:-->
				<companyName>company</companyName>
				<!--Optional:-->
				<officeName>office</officeName>
                <debtor>
                    <uniqueIdentifier>
                        <entityUniqueIdentifierType>$entityUniqueIdentifierType</entityUniqueIdentifierType>
                        <entityUniqueIdentifierValue>$entityUniqueIdentifierValue</entityUniqueIdentifierValue>
                    </uniqueIdentifier>
                    <fullName>$fullName</fullName>
                    <!--Optional:-->
					<streetName>paGetPaymentStreet</streetName>
					<!--Optional:-->
					<civicNumber>paGetPayment99</civicNumber>
					<!--Optional:-->
					<postalCode>20155</postalCode>
					<!--Optional:-->
					<city>paGetPaymentCity</city>
					<!--Optional:-->
					<stateProvinceRegion>paGetPaymentState</stateProvinceRegion>
					<!--Optional:-->
					<country>IT</country>
					<!--Optional:-->
					<e-mail>paGetPayment@test.it</e-mail>
                </debtor>
                <transferList>
                    <transfer>
                        <idTransfer>1</idTransfer>
                        <transferAmount>$transferAmount</transferAmount>
                        <fiscalCodePA>$fiscalCodePA1</fiscalCodePA>
                        <IBAN>$IBAN</IBAN>
                        <remittanceInformation>$remittanceInformation</remittanceInformation>
                        <transferCategory>$transferCategory</transferCategory>
                    </transfer>
                    <transfer>
                        <idTransfer>2</idTransfer>
                        <transferAmount>$transferAmount</transferAmount>
                        <fiscalCodePA>$fiscalCodePA2</fiscalCodePA>
                        <IBAN>$IBAN</IBAN>
                        <remittanceInformation>$remittanceInformation</remittanceInformation>
                        <transferCategory>$transferCategory</transferCategory>
                    </transfer>
                    <transfer>
                        <idTransfer>3</idTransfer>
                        <transferAmount>$transferAmount</transferAmount>
                        <fiscalCodePA>$fiscalCodePA3</fiscalCodePA>
                        <IBAN>$IBAN</IBAN>
                        <remittanceInformation>$remittanceInformation</remittanceInformation>
                        <transferCategory>$transferCategory</transferCategory>
                    </transfer>
                    <transfer>
                        <idTransfer>4</idTransfer>
                        <transferAmount>$transferAmount</transferAmount>
                        <fiscalCodePA>$fiscalCodePA4</fiscalCodePA>
                        <IBAN>$IBAN</IBAN>
                        <remittanceInformation>$remittanceInformation</remittanceInformation>
                        <transferCategory>$transferCategory</transferCategory>
                    </transfer>
                    <transfer>
                        <idTransfer>5</idTransfer>
                        <transferAmount>$transferAmount</transferAmount>
                        <fiscalCodePA>$fiscalCodePA5</fiscalCodePA>
                        <IBAN>$IBAN</IBAN>
                        <remittanceInformation>$remittanceInformation</remittanceInformation>
                        <transferCategory>$transferCategory</transferCategory>
                    </transfer>
                </transferList>
                <!--Optional:-->
				<metadata>
					<!--1 to 10 repetitions:-->
					<mapEntry>
						<key>1</key>
						<value>22</value>
					</mapEntry>
				</metadata>
            </data>
        </paf:paGetPaymentRes>
    </soapenv:Body>
</soapenv:Envelope>